{"backend": "tensorflow", "config": {"layers": [{"config": {"activation": "linear", "kernel_size": [3, 3], "filters": 64, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "batch_input_shape": [null, 128, 128, 3], "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "padding": "same", "name": "conv2d_34", "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"axis": [3], "scale": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_48", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "name": "activation_48", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "padding": "valid", "name": "max_pooling2d_34"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "name": "dropout_48"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_size": [5, 5], "filters": 128, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "padding": "same", "name": "conv2d_35", "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"axis": [3], "scale": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_49", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "name": "activation_49", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "padding": "valid", "name": "max_pooling2d_35"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "name": "dropout_49"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_size": [3, 3], "filters": 256, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "padding": "same", "name": "conv2d_36", "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"axis": [3], "scale": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_50", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "name": "activation_50", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "padding": "valid", "name": "max_pooling2d_36"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "name": "dropout_50"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_size": [3, 3], "filters": 512, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "padding": "same", "name": "conv2d_37", "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"axis": [3], "scale": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_51", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "name": "activation_51", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "padding": "valid", "name": "max_pooling2d_37"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "name": "dropout_51"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "kernel_size": [3, 3], "filters": 1024, "strides": [1, 1], "kernel_constraint": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "padding": "same", "name": "conv2d_38", "use_bias": true, "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"axis": [3], "scale": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_52", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "name": "activation_52", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "trainable": true, "dtype": "float32", "padding": "valid", "name": "max_pooling2d_38"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "name": "dropout_52"}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten_7"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "units": 1024, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_21", "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"axis": [1], "scale": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_53", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "name": "activation_53", "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.25, "noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "name": "dropout_53"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "units": 512, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_22", "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"axis": [1], "scale": true, "moving_mean_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_constraint": null, "dtype": "float32", "gamma_constraint": null, "beta_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "momentum": 0.99, "gamma_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "gamma_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {"dtype": "float32"}, "class_name": "Ones"}, "name": "batch_normalization_54", "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "trainable": true, "name": "activation_54", "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.25, "noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "name": "dropout_54"}, "class_name": "Dropout"}, {"config": {"activation": "sigmoid", "units": 1, "kernel_regularizer": null, "dtype": "float32", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"config": {"dtype": "float32", "seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_constraint": null, "name": "dense_23", "use_bias": true, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_7"}, "class_name": "Sequential", "keras_version": "2.1.6-tf"}